admbase/src/Documents/ЗаселениеСотрудников/ЗаселениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаселениеСотрудников</name>
  <registerRecords>InformationRegister.РазмещениеСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЗанятыеМестаОбщежитие</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комната</name>
      <type>
        <types>CatalogRef.КомнатыВагоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/InformationRegisters/РазмещениеСотрудников/РазмещениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </resources>
  <resources>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументВыселения</name>
    <type>
      <types>DocumentRef.ПеремещениеСотрудников</types>
      <types>DocumentRef.ВыселениеСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/InformationRegisters/ЗанятыеМестаОбщежитие/ЗанятыеМестаОбщежитие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗанятыеМестаОбщежитие</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/Documents/ЗаселениеСотрудников/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//Если ОбменДанными.Загрузка Тогда
//     Возврат;
//КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ
	|
	|	ЗаселениеСотрудников.Дата КАК Период,
	|	ЗаселениеСотрудников.Дата КАК ДатаЗаписи,
	|	ЗаселениеСотрудников.Ссылка КАК Регистратор,
	//|	ЗаселениеСотрудников.Ссылка КАК ДокументРегистрации,
	|	ЗаселениеСотрудников.АдресРегистрации,
	|	ЗаселениеСотрудников.ДатаЗаселения,
	|	ЗаселениеСотрудниковДетальныеЗаписи.Сотрудник,
	|	ЗаселениеСотрудниковДетальныеЗаписи.Комната,
	|	ЗаселениеСотрудниковДетальныеЗаписи.Место,
	|	ЗаселениеСотрудников.СтоимостьПроживания
	|ИЗ
	|	Документ.ЗаселениеСотрудников.ДетальныеЗаписи КАК ЗаселениеСотрудниковДетальныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаселениеСотрудников КАК ЗаселениеСотрудников
	|		ПО ЗаселениеСотрудниковДетальныеЗаписи.Ссылка = ЗаселениеСотрудников.Ссылка
	|ГДЕ
	|	ЗаселениеСотрудниковДетальныеЗаписи.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаселениеСотрудниковДетальныеЗаписи.НомерСтроки";

#КонецОбласти
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.РазмещениеСотрудников.Добавить(),Выборка);
		ЗаполнитьЗначенияСвойств(Движения.ЗанятыеМестаОбщежитие.Добавить(),Выборка);
	КонецЦикла;
	
	Движения.РазмещениеСотрудников.Записывать = Истина;
	Движения.ЗанятыеМестаОбщежитие.Записывать = Истина;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДетальныеЗаписи.Очистить();	

КонецПроцедуры


#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#КонецЕсли
